Напишите программу, которая определяет, является ли введенный год високосным.
В качестве ответа программа должна вывести True или False.

Ввод
На вход подается строка, состоящая из одного числа

Вывод
В единственной строке выводится значение True или False

Sample Input:

2020
Sample Output:

True

def solution(year: int) -> bool:
    pass

print(solution(int(input())))