Напишите программу, которая выводит n-ое число ряда Фибоначчи.

Ввод
На вход подается строка, состоящая из одного неотрицательного целого числа (n)

Вывод
В единственной строке выводится значение n-ого числа Фибоначчи (F(n))

Замечание
Числа Фибоначчи — элементы числовой последовательности в которой первые два числа равны 0 и 1,
а каждое последующее число равно сумме двух предыдущих чисел:
0, 1, 1, 2, 3, 5, 8, 13 ...
Будем считать, что
F(0) = 0
F(1) = 1
F(2) = 1
F(n) = F(n-1) + F(n-2)

p.s. не использовать рекурсию

Sample Input:
4

Sample Output:
3

def solution(n: int) -> int:
    # put your python code here
    pass

print(solution(int(input())))